---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalMember.CrossSectionRotation
source: html/aaa42138-0ce6-4adc-992f-eb658d99aab9.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalMember.CrossSectionRotation Property

This represents the cross-section rotation, in radians.

## Syntax (C#)
```csharp
public double CrossSectionRotation { get; set; }
```